sample/hashi/mb-op/nomad-hr-wrk-mixed-c6525-25g-exp12-havail0-hori1-verti1-infi1-t4-c512-d30-R6000
Using argument nginx
using  args: threads=4 and connections=512 and duration=30 and requests=6000
Running 30s test @ http://10.10.1.4:5000
  4 threads and 512 connections
  Thread calibration: mean lat.: 1002.591ms, rate sampling interval: 4243ms
  Thread calibration: mean lat.: 1030.609ms, rate sampling interval: 4341ms
  Thread calibration: mean lat.: 964.843ms, rate sampling interval: 4079ms
  Thread calibration: mean lat.: 976.375ms, rate sampling interval: 4046ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     3.73s     1.74s    8.22s    66.93%
    Req/Sec     1.23k    30.38     1.26k    68.75%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    3.56s 
 75.000%    4.89s 
 90.000%    6.10s 
 99.000%    8.22s 
 99.900%    9.85s 
 99.990%   10.64s 
 99.999%   11.39s 
100.000%   11.49s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.631     0.000000            1         1.00
    1565.695     0.100000         9799         1.11
    2193.407     0.200000        19604         1.25
    2697.215     0.300000        29429         1.43
    3123.199     0.400000        39206         1.67
    3561.471     0.500000        49000         2.00
    3788.799     0.550000        53910         2.22
    4036.607     0.600000        58793         2.50
    4308.991     0.650000        63731         2.86
    4583.423     0.700000        68612         3.33
    4886.527     0.750000        73518         4.00
    5046.271     0.775000        75969         4.44
    5218.303     0.800000        78386         5.00
    5406.719     0.825000        80856         5.71
    5615.615     0.850000        83266         6.67
    5857.279     0.875000        85725         8.00
    5976.063     0.887500        86952         8.89
    6103.039     0.900000        88179        10.00
    6242.303     0.912500        89389        11.43
    6393.855     0.925000        90628        13.33
    6578.175     0.937500        91832        16.00
    6680.575     0.943750        92455        17.78
    6803.455     0.950000        93080        20.00
    6930.431     0.956250        93683        22.86
    7077.887     0.962500        94282        26.67
    7241.727     0.968750        94897        32.00
    7331.839     0.971875        95205        35.56
    7421.951     0.975000        95508        40.00
    7520.255     0.978125        95823        45.71
    7630.847     0.981250        96119        53.33
    7806.975     0.984375        96424        64.00
    7901.183     0.985938        96577        71.11
    8015.871     0.987500        96731        80.00
    8138.751     0.989062        96884        91.43
    8257.535     0.990625        97040       106.67
    8388.607     0.992188        97192       128.00
    8486.911     0.992969        97268       142.22
    8593.407     0.993750        97342       160.00
    8699.903     0.994531        97421       182.86
    8781.823     0.995313        97495       213.33
    8888.319     0.996094        97572       256.00
    8970.239     0.996484        97611       284.44
    9052.159     0.996875        97648       320.00
    9199.615     0.997266        97688       365.71
    9347.071     0.997656        97726       426.67
    9502.719     0.998047        97764       512.00
    9568.255     0.998242        97782       568.89
    9609.215     0.998437        97801       640.00
    9674.751     0.998633        97822       731.43
    9732.095     0.998828        97840       853.33
    9887.743     0.999023        97860      1024.00
    9936.895     0.999121        97868      1137.78
   10067.967     0.999219        97878      1280.00
   10133.503     0.999316        97889      1462.86
   10207.231     0.999414        97897      1706.67
   10305.535     0.999512        97907      2048.00
   10338.303     0.999561        97911      2275.56
   10362.879     0.999609        97917      2560.00
   10379.263     0.999658        97921      2925.71
   10444.799     0.999707        97926      3413.33
   10469.375     0.999756        97931      4096.00
   10502.143     0.999780        97933      4551.11
   10534.911     0.999805        97935      5120.00
   10559.487     0.999829        97938      5851.43
   10584.063     0.999854        97941      6826.67
   10616.831     0.999878        97943      8192.00
   10641.407     0.999890        97944      9102.22
   10731.519     0.999902        97945     10240.00
   10829.823     0.999915        97946     11702.86
   10846.207     0.999927        97947     13653.33
   10911.743     0.999939        97949     16384.00
   10911.743     0.999945        97949     18204.44
   10969.087     0.999951        97950     20480.00
   10969.087     0.999957        97950     23405.71
   10985.471     0.999963        97951     27306.67
   11067.391     0.999969        97952     32768.00
   11067.391     0.999973        97952     36408.89
   11067.391     0.999976        97952     40960.00
   11067.391     0.999979        97952     46811.43
   11386.879     0.999982        97953     54613.33
   11386.879     0.999985        97953     65536.00
   11386.879     0.999986        97953     72817.78
   11386.879     0.999988        97953     81920.00
   11386.879     0.999989        97953     93622.86
   11485.183     0.999991        97954    109226.67
   11485.183     1.000000        97954          inf
#[Mean    =     3727.608, StdDeviation   =     1743.146]
#[Max     =    11476.992, Total count    =        97954]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  146175 requests in 30.00s, 60.32MB read
Requests/sec:   4871.82
Transfer/sec:      2.01MB