sample/hashi/mb-op/nomad-mm-wrk-compose-c6525-25g-exp12-havail0-hori1-verti1-infi1-t4-c512-d30-R4000
Using argument nginx
using  args: threads=4 and connections=512 and duration=30 and requests=4000
Running 30s test @ http://10.10.1.4:8080/wrk2-api/user-timeline/read
  4 threads and 512 connections
  Thread calibration: mean lat.: 1282.880ms, rate sampling interval: 5627ms
  Thread calibration: mean lat.: 1281.490ms, rate sampling interval: 5840ms
  Thread calibration: mean lat.: 1306.923ms, rate sampling interval: 5767ms
  Thread calibration: mean lat.: 1450.699ms, rate sampling interval: 5885ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     6.48s     2.42s   11.93s    64.07%
    Req/Sec   642.75      9.56   653.00     66.67%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    6.35s 
 75.000%    8.27s 
 90.000%    9.80s 
 99.000%   11.93s 
 99.900%   13.15s 
 99.990%   13.86s 
 99.999%   14.02s 
100.000%   14.02s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

     168.575     0.000000            1         1.00
    3409.919     0.100000         5102         1.11
    4214.783     0.200000        10213         1.25
    4935.679     0.300000        15346         1.43
    5648.383     0.400000        20426         1.67
    6352.895     0.500000        25516         2.00
    6705.151     0.550000        28059         2.22
    7069.695     0.600000        30632         2.50
    7442.431     0.650000        33161         2.86
    7856.127     0.700000        35712         3.33
    8273.919     0.750000        38287         4.00
    8503.295     0.775000        39579         4.44
    8732.671     0.800000        40847         5.00
    8978.431     0.825000        42129         5.71
    9224.191     0.850000        43379         6.67
    9494.527     0.875000        44652         8.00
    9641.983     0.887500        45296         8.89
    9797.631     0.900000        45922        10.00
    9961.471     0.912500        46558        11.43
   10149.887     0.925000        47214        13.33
   10362.879     0.937500        47842        16.00
   10477.567     0.943750        48157        17.78
   10592.255     0.950000        48467        20.00
   10715.135     0.956250        48786        22.86
   10862.591     0.962500        49121        26.67
   11018.239     0.968750        49428        32.00
   11100.159     0.971875        49590        35.56
   11198.463     0.975000        49750        40.00
   11313.151     0.978125        49900        45.71
   11427.839     0.981250        50057        53.33
   11575.295     0.984375        50222        64.00
   11665.407     0.985938        50300        71.11
   11755.519     0.987500        50379        80.00
   11853.823     0.989062        50457        91.43
   11968.511     0.990625        50541       106.67
   12107.775     0.992188        50620       128.00
   12173.311     0.992969        50659       142.22
   12255.231     0.993750        50695       160.00
   12345.343     0.994531        50737       182.86
   12443.647     0.995313        50777       213.33
   12525.567     0.996094        50814       256.00
   12599.295     0.996484        50838       284.44
   12656.639     0.996875        50855       320.00
   12713.983     0.997266        50875       365.71
   12771.327     0.997656        50894       426.67
   12886.015     0.998047        50916       512.00
   12910.591     0.998242        50924       568.89
   13000.703     0.998437        50935       640.00
   13033.471     0.998633        50945       731.43
   13090.815     0.998828        50955       853.33
   13172.735     0.999023        50964      1024.00
   13197.311     0.999121        50969      1137.78
   13271.039     0.999219        50974      1280.00
   13303.807     0.999316        50979      1462.86
   13352.959     0.999414        50986      1706.67
   13418.495     0.999512        50989      2048.00
   13451.263     0.999561        50991      2275.56
   13500.415     0.999609        50994      2560.00
   13516.799     0.999658        50996      2925.71
   13557.759     0.999707        50999      3413.33
   13598.719     0.999756        51001      4096.00
   13631.487     0.999780        51002      4551.11
   13737.983     0.999805        51004      5120.00
   13746.175     0.999829        51005      5851.43
   13811.711     0.999854        51006      6826.67
   13836.287     0.999878        51007      8192.00
   13860.863     0.999890        51008      9102.22
   13918.207     0.999902        51009     10240.00
   13918.207     0.999915        51009     11702.86
   13983.743     0.999927        51010     13653.33
   13983.743     0.999939        51010     16384.00
   14008.319     0.999945        51011     18204.44
   14008.319     0.999951        51011     20480.00
   14008.319     0.999957        51011     23405.71
   14024.703     0.999963        51013     27306.67
   14024.703     1.000000        51013          inf
#[Mean    =     6476.944, StdDeviation   =     2424.408]
#[Max     =    14016.512, Total count    =        51013]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  77884 requests in 30.00s, 13.67MB read
Requests/sec:   2596.10
Transfer/sec:    466.49KB